// ------------ نافذه منبثقة-------------------

alert("Mohammed Safaa Alzobie");

// ------------------------------------------

// ------------ نافذه منبثقة-------------------

window.alert("Mohammed Safaa Alzobie");

// ------------------------------------------

// ------------ نافذه منبثقة-------------------

confirm("Mohammed Safaa Alzobie");

// ------------------------------------------

// ------------ نافذه منبثقة-------------------

window.confirm("Mohammed Safaa Alzobie");

// ------------------------------------------


// ------------ نافذه منبثقة-------------------

prompt("Mohammed Safaa Alzobie");

// ------------------------------------------

// ------------ نافذه منبثقة-------------------

window.prompt("Mohammed Safaa Alzobie");

// ------------------------------------------

// ------------ الانتقال الى صفحة ثانية-------------------
function getPage(){
    window.open("https://www.google.com");
}


// ------------------------------------------


// ------------close window غلق  الصفحة -------------------

function closePage(){
 window.close();
}

// ------------------------------------------



